In [ ]:
df.loc(df["Revenue"]>=40000,axis=0)

In [15]:
df

      Id        Date Region     Category Salesperson  Quantity  Revenue
0   1001  2024-01-01  North  Electronics        Amit         2    40000
1   1002  2024-01-01  South  Electronics        Riya         1    20000
2   1003  2024-01-02  North    Furniture        Amit         3    30000
3   1004  2024-01-02   East    Furniture      Suresh         2    25000
4   1005  2024-01-03  South  Electronics        Riya         1    22000
5   1006  2024-01-03   West    Furniture        Neha         4    60000
6   1007  2024-01-04  North  Electronics        Amit         2    42000
7   1008  2024-01-04   East    Furniture      Suresh         3    28000
8   1009  2024-01-05   West  Electronics        Neha         1    60000
9   1010  2024-01-05  South    Furniture        Riya         2    26000
10  1011  2024-01-06  North  Electronics        Amit         3    38000
11  1012  2024-01-06   West    Furniture        Neha         2    60000
12  1013  2024-01-07   East  Electronics      Suresh         1    29000
13  1014  2024-01-07  South    Furniture        Riya         2    24000
14  1015  2024-01-08  North  Electronics        Amit         4    50000
15  1016  2024-01-08   West    Furniture        Neha         1    60000
16  1017  2024-01-09   East  Electronics      Suresh         3    31000
17  1018  2024-01-09  South    Furniture        Riya         2    27000
18  1019  2024-01-10  North  Electronics        Amit         1    39000
19  1020  2024-01-10   West    Furniture        Neha         2    60000

In [14]:
df.loc(len(df)==[20,1012,'2003-12-14','North','Furniture','Sushant',5,50000])

In [11]:
df.isnull()

       Id   Date  Region  Category  Salesperson  Quantity  Revenue
0   False  False   False     False        False     False    False
1   False  False   False     False        False     False    False
2   False  False   False     False        False     False    False
3   False  False   False     False        False     False    False
4   False  False   False     False        False     False    False
5   False  False   False     False        False     False    False
6   False  False   False     False        False     False    False
7   False  False   False     False        False     False    False
8   False  False   False     False        False     False    False
9   False  False   False     False        False     False    False
10  False  False   False     False        False     False    False
11  False  False   False     False        False     False    False
12  False  False   False     False        False     False    False
13  False  False   False     False        False     False    False
14  False  False   False     False        False     False    False
15  False  False   False     False        False     False    False
16  False  False   False     False        False     False    False
17  False  False   False     False        False     False    False
18  False  False   False     False        False     False    False
19  False  False   False     False        False     False    False

In [10]:
df

      Id        Date Region     Category Salesperson  Quantity  Revenue
0   1001  2024-01-01  North  Electronics        Amit         2    40000
1   1002  2024-01-01  South  Electronics        Riya         1    20000
2   1003  2024-01-02  North    Furniture        Amit         3    30000
3   1004  2024-01-02   East    Furniture      Suresh         2    25000
4   1005  2024-01-03  South  Electronics        Riya         1    22000
5   1006  2024-01-03   West    Furniture        Neha         4    60000
6   1007  2024-01-04  North  Electronics        Amit         2    42000
7   1008  2024-01-04   East    Furniture      Suresh         3    28000
8   1009  2024-01-05   West  Electronics        Neha         1    60000
9   1010  2024-01-05  South    Furniture        Riya         2    26000
10  1011  2024-01-06  North  Electronics        Amit         3    38000
11  1012  2024-01-06   West    Furniture        Neha         2    60000
12  1013  2024-01-07   East  Electronics      Suresh         1    29000
13  1014  2024-01-07  South    Furniture        Riya         2    24000
14  1015  2024-01-08  North  Electronics        Amit         4    50000
15  1016  2024-01-08   West    Furniture        Neha         1    60000
16  1017  2024-01-09   East  Electronics      Suresh         3    31000
17  1018  2024-01-09  South    Furniture        Riya         2    27000
18  1019  2024-01-10  North  Electronics        Amit         1    39000
19  1020  2024-01-10   West    Furniture        Neha         2    60000

In [9]:
df.loc[df.Salesperson=="Neha","Revenue"]=60000

In [66]:
df[(df["Category"]=="Electronics")&(df["Revenue"]>=40000)]

    Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0       1001  2024-01-01  North  Electronics        Amit         2    40000
6       1007  2024-01-04  North  Electronics        Amit         2    42000
14      1015  2024-01-08  North  Electronics        Amit         4    50000

In [8]:
df.loc[(df.Salesperson=="Suresh")&(df.Revenue==40000)]

Empty DataFrame
Columns: [Id, Date, Region, Category, Salesperson, Quantity, Revenue]
Index: []

In [62]:
df["Salesperson"].value_counts()

Salesperson
Amit      6
Riya      5
Neha      5
Suresh    4
Name: count, dtype: int64

In [61]:
df["Salesperson"].count()

np.int64(20)

In [60]:
df.loc[df.Category=="Electronics"]

    Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0       1001  2024-01-01  North  Electronics        Amit         2    40000
1       1002  2024-01-01  South  Electronics        Riya         1    20000
4       1005  2024-01-03  South  Electronics        Riya         1    22000
6       1007  2024-01-04  North  Electronics        Amit         2    42000
8       1009  2024-01-05   West  Electronics        Neha         1    21000
10      1011  2024-01-06  North  Electronics        Amit         3    38000
12      1013  2024-01-07   East  Electronics      Suresh         1    29000
14      1015  2024-01-08  North  Electronics        Amit         4    50000
16      1017  2024-01-09   East  Electronics      Suresh         3    31000
18      1019  2024-01-10  North  Electronics        Amit         1    39000

In [58]:
var[var["Category"]=="Electronics"]

    Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0       1001  2024-01-01  North  Electronics        Amit         2    40000
1       1002  2024-01-01  South  Electronics        Riya         1    20000
4       1005  2024-01-03  South  Electronics        Riya         1    22000
6       1007  2024-01-04  North  Electronics        Amit         2    42000
8       1009  2024-01-05   West  Electronics        Neha         1    21000
10      1011  2024-01-06  North  Electronics        Amit         3    38000
12      1013  2024-01-07   East  Electronics      Suresh         1    29000
14      1015  2024-01-08  North  Electronics        Amit         4    50000
16      1017  2024-01-09   East  Electronics      Suresh         3    31000
18      1019  2024-01-10  North  Electronics        Amit         1    39000

In [5]:
df.columns

Index(['Id', 'Date', 'Region', 'Category', 'Salesperson', 'Quantity',
       'Revenue'],
      dtype='str')

In [4]:
df.rename(columns={"Order_ID":"Id"},inplace=True)

In [55]:
df.iloc[3,6]

np.int64(25000)

In [54]:
df.loc[3,"Revenue"]

np.int64(25000)

In [53]:
df.iloc[1,2]

'South'

In [52]:
df.loc[1,"Region"]

'South'

In [51]:
df.iloc[1]

Order_ID              1002
Date            2024-01-01
Region               South
Category       Electronics
Salesperson           Riya
Quantity                 1
Revenue              20000
Name: 1, dtype: object

In [50]:
df.head()

   Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0      1001  2024-01-01  North  Electronics        Amit         2    40000
1      1002  2024-01-01  South  Electronics        Riya         1    20000
2      1003  2024-01-02  North    Furniture        Amit         3    30000
3      1004  2024-01-02   East    Furniture      Suresh         2    25000
4      1005  2024-01-03  South  Electronics        Riya         1    22000

In [48]:
df.loc[1]

Order_ID              1002
Date            2024-01-01
Region               South
Category       Electronics
Salesperson           Riya
Quantity                 1
Revenue              20000
Name: 1, dtype: object

In [42]:
df.columns

Index(['Order_ID', 'Date', 'Region', 'Category', 'Salesperson', 'Quantity',
       'Revenue'],
      dtype='str')

In [47]:
df["Order_ID"].sum()

np.int64(20210)

In [37]:
df.groupby("Category")["Revenue"].max()

Category
Electronics    50000
Furniture      48000
Name: Revenue, dtype: int64

In [33]:
df.groupby("Category")["Revenue"].sum()

Category
Electronics    332000
Furniture      323000
Name: Revenue, dtype: int64

In [29]:
print(df[["Category","Region","Salesperson","Revenue"]])

       Category Region Salesperson  Revenue
0   Electronics  North        Amit    40000
1   Electronics  South        Riya    20000
2     Furniture  North        Amit    30000
3     Furniture   East      Suresh    25000
4   Electronics  South        Riya    22000
5     Furniture   West        Neha    45000
6   Electronics  North        Amit    42000
7     Furniture   East      Suresh    28000
8   Electronics   West        Neha    21000
9     Furniture  South        Riya    26000
10  Electronics  North        Amit    38000
11    Furniture   West        Neha    47000
12  Electronics   East      Suresh    29000
13    Furniture  South        Riya    24000
14  Electronics  North        Amit    50000
15    Furniture   West        Neha    23000
16  Electronics   East      Suresh    31000
17    Furniture  South        Riya    27000
18  Electronics  North        Amit    39000
19    Furniture   West        Neha    48000

In [28]:
print(df[["Salesperson","Revenue"]])

   Salesperson  Revenue
0         Amit    40000
1         Riya    20000
2         Amit    30000
3       Suresh    25000
4         Riya    22000
5         Neha    45000
6         Amit    42000
7       Suresh    28000
8         Neha    21000
9         Riya    26000
10        Amit    38000
11        Neha    47000
12      Suresh    29000
13        Riya    24000
14        Amit    50000
15        Neha    23000
16      Suresh    31000
17        Riya    27000
18        Amit    39000
19        Neha    48000

In [27]:
print(df[["Category","Region"]])

       Category Region
0   Electronics  North
1   Electronics  South
2     Furniture  North
3     Furniture   East
4   Electronics  South
5     Furniture   West
6   Electronics  North
7     Furniture   East
8   Electronics   West
9     Furniture  South
10  Electronics  North
11    Furniture   West
12  Electronics   East
13    Furniture  South
14  Electronics  North
15    Furniture   West
16  Electronics   East
17    Furniture  South
18  Electronics  North
19    Furniture   West

In [26]:
df.columns

Index(['Order_ID', 'Date', 'Region', 'Category', 'Salesperson', 'Quantity',
       'Revenue'],
      dtype='str')

In [20]:
print(df["Region"])

0     North
1     South
2     North
3      East
4     South
5      West
6     North
7      East
8      West
9     South
10    North
11     West
12     East
13    South
14    North
15     West
16     East
17    South
18    North
19     West
Name: Region, dtype: str

In [19]:
print(df["Category"])

0     Electronics
1     Electronics
2       Furniture
3       Furniture
4     Electronics
5       Furniture
6     Electronics
7       Furniture
8     Electronics
9       Furniture
10    Electronics
11      Furniture
12    Electronics
13      Furniture
14    Electronics
15      Furniture
16    Electronics
17      Furniture
18    Electronics
19      Furniture
Name: Category, dtype: str

In [17]:
df.columns

Index(['Order_ID', 'Date', 'Region', 'Category', 'Salesperson', 'Quantity',
       'Revenue'],
      dtype='str')

In [15]:
df.head()
# df.tail()

   Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0      1001  2024-01-01  North  Electronics        Amit         2    40000
1      1002  2024-01-01  South  Electronics        Riya         1    20000
2      1003  2024-01-02  North    Furniture        Amit         3    30000
3      1004  2024-01-02   East    Furniture      Suresh         2    25000
4      1005  2024-01-03  South  Electronics        Riya         1    22000

In [14]:
# df.shape
df.info()
# df.describe

<class 'pandas.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Order_ID     20 non-null     int64
 1   Date         20 non-null     str
 2   Region       20 non-null     str
 3   Category     20 non-null     str
 4   Salesperson  20 non-null     str
 5   Quantity     20 non-null     int64
 6   Revenue      20 non-null     int64
dtypes: int64(3), str(4)
memory usage: 1.2 KB

In [3]:
df=pd.DataFrame(var)
df

    Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0       1001  2024-01-01  North  Electronics        Amit         2    40000
1       1002  2024-01-01  South  Electronics        Riya         1    20000
2       1003  2024-01-02  North    Furniture        Amit         3    30000
3       1004  2024-01-02   East    Furniture      Suresh         2    25000
4       1005  2024-01-03  South  Electronics        Riya         1    22000
5       1006  2024-01-03   West    Furniture        Neha         4    45000
6       1007  2024-01-04  North  Electronics        Amit         2    42000
7       1008  2024-01-04   East    Furniture      Suresh         3    28000
8       1009  2024-01-05   West  Electronics        Neha         1    21000
9       1010  2024-01-05  South    Furniture        Riya         2    26000
10      1011  2024-01-06  North  Electronics        Amit         3    38000
11      1012  2024-01-06   West    Furniture        Neha         2    47000
12      1013  2024-01-07   East  Electronics      Suresh         1    29000
13      1014  2024-01-07  South    Furniture        Riya         2    24000
14      1015  2024-01-08  North  Electronics        Amit         4    50000
15      1016  2024-01-08   West    Furniture        Neha         1    23000
16      1017  2024-01-09   East  Electronics      Suresh         3    31000
17      1018  2024-01-09  South    Furniture        Riya         2    27000
18      1019  2024-01-10  North  Electronics        Amit         1    39000
19      1020  2024-01-10   West    Furniture        Neha         2    48000

In [2]:
var=pd.read_csv("sales_dataset.csv")
var

    Order_ID        Date Region     Category Salesperson  Quantity  Revenue
0       1001  2024-01-01  North  Electronics        Amit         2    40000
1       1002  2024-01-01  South  Electronics        Riya         1    20000
2       1003  2024-01-02  North    Furniture        Amit         3    30000
3       1004  2024-01-02   East    Furniture      Suresh         2    25000
4       1005  2024-01-03  South  Electronics        Riya         1    22000
5       1006  2024-01-03   West    Furniture        Neha         4    45000
6       1007  2024-01-04  North  Electronics        Amit         2    42000
7       1008  2024-01-04   East    Furniture      Suresh         3    28000
8       1009  2024-01-05   West  Electronics        Neha         1    21000
9       1010  2024-01-05  South    Furniture        Riya         2    26000
10      1011  2024-01-06  North  Electronics        Amit         3    38000
11      1012  2024-01-06   West    Furniture        Neha         2    47000
12      1013  2024-01-07   East  Electronics      Suresh         1    29000
13      1014  2024-01-07  South    Furniture        Riya         2    24000
14      1015  2024-01-08  North  Electronics        Amit         4    50000
15      1016  2024-01-08   West    Furniture        Neha         1    23000
16      1017  2024-01-09   East  Electronics      Suresh         3    31000
17      1018  2024-01-09  South    Furniture        Riya         2    27000
18      1019  2024-01-10  North  Electronics        Amit         1    39000
19      1020  2024-01-10   West    Furniture        Neha         2    48000

In [6]:
df.to_excel("dataframe.xlsx",index=False)

In [4]:
df=pd.DataFrame(var)
df

,StudentID,Name,City,Age,Score,JoinedDate,IsActive,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15
0,S001,Student_1,Pune,26.0,58.55,2024-01-01,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,S002,Student_2,Kolkata,22.0,76.41,2024-01-02,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,S003,Student_3,Kolkata,18.0,92.66,2024-01-03,0.0,NaN,NaN,NaN,6464.0,NaN,NaN,NaN,NaN,NaN
3,S004,Student_4,Bengaluru,22.0,58.34,2024-01-04,0.0,NaN,NaN,NaN,NaN,NaN,NaN,40.0,NaN,NaN
4,S005,Student_5,Delhi,29.0,81.87,2024-01-05,1.0,NaN,NaN,NaN,NaN,NaN,NaN,199.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,S096,Student_96,Bengaluru,22.0,95.57,2024-04-05,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
97,S097,Student_97,Bengaluru,26.0,72.55,2024-04-06,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98,S098,Student_98,Delhi,22.0,49.99,2024-04-07,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,S099,Student_99,Mumbai,29.0,67.41,2024-04-08,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
100,S100,Student_100,Hyderabad,23.0,79.15,2024-04-09,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
var=pd.read_excel("Student_XLSX.xlsx")
var

,StudentID,Name,City,Age,Score,JoinedDate,IsActive,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15
0,S001,Student_1,Pune,26.0,58.55,2024-01-01,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,S002,Student_2,Kolkata,22.0,76.41,2024-01-02,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,S003,Student_3,Kolkata,18.0,92.66,2024-01-03,0.0,NaN,NaN,NaN,6464.0,NaN,NaN,NaN,NaN,NaN
3,S004,Student_4,Bengaluru,22.0,58.34,2024-01-04,0.0,NaN,NaN,NaN,NaN,NaN,NaN,40.0,NaN,NaN
4,S005,Student_5,Delhi,29.0,81.87,2024-01-05,1.0,NaN,NaN,NaN,NaN,NaN,NaN,199.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,S096,Student_96,Bengaluru,22.0,95.57,2024-04-05,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
97,S097,Student_97,Bengaluru,26.0,72.55,2024-04-06,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98,S098,Student_98,Delhi,22.0,49.99,2024-04-07,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,S099,Student_99,Mumbai,29.0,67.41,2024-04-08,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
100,S100,Student_100,Hyderabad,23.0,79.15,2024-04-09,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
var=pd.read_csv("Student_CSV.csv")
var

   StudentID         Name       City  Age  Score  JoinedDate  IsActive
0       S001    Student_1       Pune   26  58.55  2024-01-01      True
1       S002    Student_2    Kolkata   22  76.41  2024-01-02     False
2       S003    Student_3    Kolkata   18  92.66  2024-01-03     False
3       S004    Student_4  Bengaluru   22  58.34  2024-01-04     False
4       S005    Student_5      Delhi   29  81.87  2024-01-05      True
..       ...          ...        ...  ...    ...         ...       ...
95      S096   Student_96  Bengaluru   22  95.57  2024-04-05     False
96      S097   Student_97  Bengaluru   26  72.55  2024-04-06     False
97      S098   Student_98      Delhi   22  49.99  2024-04-07      True
98      S099   Student_99     Mumbai   29  67.41  2024-04-08      True
99      S100  Student_100  Hyderabad   23  79.15  2024-04-09     False

[100 rows x 7 columns]

In [6]:
var=pd.read_json("Student_JSON.json")
var

   StudentID         Name       City  Age  Score  JoinedDate  IsActive
0       S001    Student_1       Pune   26  58.55  2024-01-01      True
1       S002    Student_2    Kolkata   22  76.41  2024-01-02     False
2       S003    Student_3    Kolkata   18  92.66  2024-01-03     False
3       S004    Student_4  Bengaluru   22  58.34  2024-01-04     False
4       S005    Student_5      Delhi   29  81.87  2024-01-05      True
..       ...          ...        ...  ...    ...         ...       ...
95      S096   Student_96  Bengaluru   22  95.57  2024-04-05     False
96      S097   Student_97  Bengaluru   26  72.55  2024-04-06     False
97      S098   Student_98      Delhi   22  49.99  2024-04-07      True
98      S099   Student_99     Mumbai   29  67.41  2024-04-08      True
99      S100  Student_100  Hyderabad   23  79.15  2024-04-09     False

[100 rows x 7 columns]

In [4]:
var=pd.DataFrame(list1)
var

           0
0    sushant
1     ishant
2   prashant
3    nishant
4  raunakant

In [3]:
list1=["sushant","ishant","prashant","nishant","raunakant"]
print(list1)
df=pd.Series(list1)
df

['sushant', 'ishant', 'prashant', 'nishant', 'raunakant']

0      sushant
1       ishant
2     prashant
3      nishant
4    raunakant
dtype: str

In [2]:
pd.__version__

'3.0.0'

In [1]:
import pandas as pd